[M_IrisHUB_SmackTalk MissionDefinition]
MissionName="Chat with a search engine in the hall"
MissionDescription="max has written many interviews with Dr. Torgue (making him talk about being an incorrigible killing machine), but the details are gone. He asked her to find him and send him again.."
TurnInDescription="The content of these interviews should (a) not look down on you and (b) be enough to convince other great people that you are a completely different type of teacher.."
MissionSummary="Find things with EHO [place]Tough Pete[-place]"
MissionGiver="Moxie"
MissionTurnInLocation="Moxxi"
TeaserText="Do not underestimate the power of social media.."

[M_IrisHUB_SmackTalk:FindLostRecorders MissionObjectiveDefinition]
ProgressMessage="Find your lost device"

[M_IrisHUB_SmackTalk:MissionObjectiveSetDefinition_0 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisHUB_SmackTalk:MissionObjectiveSetDefinition_1 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

